app/Models/newsModel.php

SELECT *
FROM `news`
SELECT *
FROM `news`
WHERE `description` = 'Pameran seni lokal'
 LIMIT 1
---
    public function getNews($description = false)    // Fungsi getNews digunakan untuk mengambil data berita
    {
        if ($description === false) {   // Jika parameter $description bernilai false, maka fungsi akan mengembalikan semua berita
            return $this->findAll();
        }

        return $this->where(['description' => $description])->first();  // Jika parameter $description memiliki nilai, maka fungsi akan mencari berita dengan deskripsi yang sesuai